#pragma once

namespace hw9p2
{
	/*
	ƒаны четыре целых неотрицательных числа, найдите и выведите среди них число с наибольшей последней цифрой.
	≈сли таких чисел несколько, выведите наибольшее из них.
	*/
	void task1();

	/*
	ƒаны четыре целых положительных числа, найдите минимальное нечетное число (гарантируетс€, что нечетные числа есть).
	«атем уменьшите все нечетные числа, которые больше найденного значени€,
	на найденное значение и выведите все четыре числа в том же пор€дке, каждое число в новой строчке.
	*/
	void task2();

	/*
	ѕет€ живет в городе ѕ, его друг ¬ан€ живет в городе ¬.
	ƒвое друзей не виделись весь карантин, как только вирус был побежден, они сели на велосипеды и поехали друг на встречу другу.
	ќпределите, через сколько секунд они встрет€тс€, если на вход мы получаем
	три целых положительных числа: рассто€ние между городами ѕ и ¬ в метрах, скорость ѕети (м/c) и скорость ¬ани (м/c).
	*/
	void task3();
}